       IDENTIFICATION DIVISION.
       PROGRAM-ID. Nomina.
       AUTHOR. MARCOS CANUL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NOMBRE-EMPLEADO     PIC A(50).
       01 HORAS-TRABAJADAS    PIC 9(3).
       END PROGRAM Nomina.